// testSeg.cpp : 定义控制台应用程序的入口点。
//

#include <vector>
#include <iostream>
#include <fstream>
#include <string>
#include <list>
#include <string>
using namespace std;

#include "PrepareDictionaries.h"

#include <config.h>
#include "testsuite.h"

struct test {
	const string query;//the query is the string that is be segmented
	const string expect;// the expect is the string after been segmented
};


static const test test_segmentation_strings[] = {
	
	{"其实不是我的 ","其实|不是|我的| "},
	
	{"叶莘：毕业以后，我还是想回来  ","叶莘|：|毕业|以后|，|我还是|想回来|  "},
	
	{"一方面，家在广州，女朋友以后也会回广州工作 ","一方面|，|家在|广州|，|女朋友|以后|也会|回|广州|工作| "},
	{"在国内，生物相关产业发展很不够，很多同学毕业后都转行 ", "在|国内|，|生物|相关|产业|发展|很不|够|，|很多|同学|毕业|后|都|转行| "},
	{"比如说能源，传统的煤、电、石油不可能永远持续，生物能源就很有前景 ","比如说|能源|，|传统|的煤|、|电|、|石油|不可能|永远|持续|，|生物能|源|就很|有|前景| "},	
	{"利物浦是在伦敦和伯明翰之后第三个发生骚乱事件的英国大城市 ","利物浦|是在|伦敦|和|伯明翰|之后|第三个|发生|骚乱|事件|的|英国|大城市| "},
	{"一进村子就听到阵阵哭声 ","一进|村子|就|听到|阵阵|哭声| "},
	{"只见一个男孩和两个女孩在河边地上躺着 ","只见|一个|男孩|和|两个|女孩|在|河边|地上|躺着| "},
	{"一个在不停地呕吐，两个已经昏迷 ","一个|在|不停地|呕吐|，|两个|已经|昏迷| "},
	{"新婚姻法解释（三）实施后面临的头号争议就是关于第七条 ","新婚|姻|姻法|解释|（|三|）|实施|后面|临的|头号|争议|就是|关于|第七|条| "},	{"婚后由一方父母出资为子女购买的不动产 ","婚后|由|一方|父母|出资|为子|女|购买|的|不动产| "},
	{"很多女性认为这解释对她们不公平 ","很多|女性|认为|这|解释|对她|们|不公平| "},
	{"而沦为笑谈的“丈母娘需求论”则可能进一步变异为一定要让女方的名字“登上”房产证 ","而|沦为|笑谈|的|“|丈母娘|需求|论|”|则可|能进|一步|变异|为|一定要|让|女方|的|名字|“|登上|”|房产证| "},
	{"事发已经三个多月，事件处理只停留在刑拘两名司机上 ", "事发|已经|三个|多月|，|事件|处理|只停|留在|刑拘|两名|司机|上| "},
	{"即使备用设施也被雷击摧毁 ","即使|备用|设施|也被|雷击|摧毁| "},
	{"列车故障停运，应该有多个渠道发现、多个信息渠道通知后车紧急应对啊 ","列车|故障|停运|，|应该有|多个|渠道|发现|、|多个|信息|渠道|通知|后车|紧急|应对|啊| "},	
	{"向我们展示出这两种截然不同的对于神灵、生死、人生和天堂的信仰体系如何成为东西方长期以来互相误解 ","向我|们|展示出|这|两种|截然不同|的|对于|神灵|、|生死|、|人生|和|天堂|的|信仰|体系|如何|成为|东西方|长期以来|互相|误解| "},	
	{"于是对于已有十多年屋龄的老屋 ","于是|对于|已有|十多年|屋龄的老屋| "},			
	{"但是受到各种环境影响，还是成就了它们各自的性格 ","但是|受到|各种|环境|影响|，|还是|成就|了|它们|各自|的|性格| "},	
	{"我知道它并不属于我，因为我只是个编辑 ","我知道|它|并不|属于|我|，|因为|我只|是个|编辑| "},
	{"就算给我一辆，那我在后面可能能做的也只是补补觉 ","就算|给我|一辆|，|那我|在后面|可能|能做|的|也只|是补补觉| "},
	{"国税总局指出，从未发过该文件及解读稿 ","国税|总局|指出|，|从未|发过|该文|件|件及|解读|稿| "},
	{"年终奖仍旧按照现行的计算方法与新税法衔接 ","年终奖|仍旧|按照|现行|的|计算方法|与|新税|法|衔接| "},
	{"由于该文内容提到时下备受关注的“年终奖税收”可通过两种方式计算 ","由于|该文|内容|提到|时下|备受|关注|的|“|年终奖|税收|”|可通过|两种|方式|计算| "},
	{"14日国内多家媒体均对此做出报道 ","14|日|国内|多家|媒体|均|对此|做出|报道| "},
	{"他是洋帅史上名头最大的主教练，同时也是要求最低的———在国足连续两届未入十强赛的背景之下，打入世界杯决赛圈并非他的硬性考核条件 ","他是|洋帅|史上|名头|最大的|主教练|，|同时|也是|要求|最低|的|———|——|——|在国足|连续|两届|未入|十强|赛的|背景|之下|，|打入|世界杯|决赛|圈|并非|他的|硬性|考核|条件| "},
	{"楼市是经济的晴雨表，当整个经济大环境出现问题时，楼市会率先受到冲击，这一点，在历史上曾有多次佐证 ","楼市|是|经济|的|晴雨表|，当|整个|经济|大环境|出现问题|时|，|楼市|会|率先|受到冲击|，|这一点|，|在历史上|曾有|多次|佐证| "},
	{"那么现在你不需要再等待太长的时间了，因为我们现在得到了来自于一家加拿大汽车杂志的扫描图 ","那么|现在|你|不需要|再等|待|太长|的|时间|了|，|因为|我们|现在|得到|了|来自于|一家|加拿大|汽车|杂志|的|扫描|图| "},
	{"前日，有媒体记者在微博中爆料，章子怡与前男友霍启山再度复合 ","前日|，有|媒体|记者|在微|在微博中|博中|爆料|，|章子怡|与|前|男友|霍启|霍启山|启山|再度|复合| "},
	{"基于Linux及Java开发的Android操作系统从诞生之日起就注定存在大量的专利侵权硬伤 ","基于|Linux|及|Java|开发|的|Android|操作系统|从|诞生|之日起|就|注定|存在|大量的|专利|侵权|硬伤| "},
	{"在这一行业拥有数一数二的专利库资源，自然是最佳选择 ","在这|一行|业|拥有|数一数二|的|专利|库|资源|，|自然是|最佳|选择| "},
	{"我和许多人一样，是一个外地孩子在北京打拼 ","我和|许多人|一样|，是|一个|外地|孩子|在|北京|打拼| "},
	{"或许人生跟游戏一样，它也分简单模式、复杂模式，甚至有像《植物大战僵尸》里面的无穷挑战模式 ","或许|人生|跟|游戏|一样|，|它也|分|简单|模式|、|复杂|模式|，|甚至有|像|《|植物|大战|僵尸|》|里面|的|无穷|挑战|模式| "},
	{"而且这是我自己选择的路，我心甘情愿，觉得挺好的 ","而且|这是|我自己|选择|的路|，|我心|甘|情愿|，|觉得|挺好|的| "},
	{"很多年轻人会觉得，养生是老人家的事，自己还年轻，谈健康？多老土 ","很多|年轻人|会|觉得|，|养生|是|老人家|的事|，|自己|还|年轻|，谈|健康|？|多老|土| "},
	{"原定7月正式挂牌的中国广播电视网络公司挂牌时间被迫推迟 ","原定|7|月|正式|挂牌|的|中国广播|电视网|络|公司|挂牌|时间|被迫|推迟| "},
	{"已经完成省网整合的广西、贵州等资产可能会先期注入，未来更要谋求上市 ","已经|完成|省网|整合|的|广西|、|贵州|等|资产|可能会|先期|注入|，|未来|更要|谋求|上市| "},
	{"在国家网络公司成立后，广电系统的实力和话语权必然有所提高 ","在|国家|网络公司|成立|后|，|广电|系统的|实力|和|话语|权|必然|有所提高| "},
	{"如果广电系统只是复制电信系统曾经的发展模式，无疑会降低资金的使用效率 ","如果|广电|系统|只是|复制|电信|系统|曾经|的|发展|模式|，|无疑|会|降低|资金|的|使用|效率| "},
	{"上述消息已经媒体披露，立刻引起社会的广泛关注 ","上述|消息|已经|媒体|披露|，|立刻|引起|社会|的|广泛|关注| "},
	{"与会负责人一致对王建忠严重不负责任的言论表示强烈的谴责 ","与会|负责人|一致|对|对王建忠|王建|王建忠|建忠|严重|不负责任|的|言论|表示|强烈|的|谴责| "},
	{"并且协会作出决定责令王建忠辞去协会副会长职务 ","并且|协会|作出决定|责令|王建|王建忠|建忠|辞去|协会|副会长|职务| "},	
	{"忽悠啊就是看起来说的话头头是道，其实什么内容都没有你还乖乖交钱 ","忽悠|啊|就是|看起来|说的|话头|头是道|，|其实|什么|内容|都没有|你|还|乖乖|交钱| "},
	{"偶MBA毕业时有不少同学进了四大的Consulting ","偶|MBA|毕业|时有|不少|同学|进了|四大|的|Consulting "},
	{"但是，对于这样的报道，笔者在产生怀疑的同时，也产生了一丝隐隐的担忧 ","但是|，|对于|这样的|报道|，|笔者|在|产生|怀疑|的|同时|，也|产生|了|一丝|隐隐|的|担忧| "},
	{"笔者怀疑，五道杠少年是一则假新闻，一些事迹存在虚构的成分 ","笔者|怀疑|，|五道|杠|少年|是|一则|假|新闻|，|一些|事迹|存在|虚构|的|成分| "},
	{"理性的婚姻应该告别谋利时代，当然，要真正回归到情感交融的本质，最后还是需要一种让这个时代拥有普通认同的文化价值来救赎 ","理性|的|婚姻|应该|告别|谋利|时代|，|当然|，要|真正|回归|到|情感|交融|的|本质|，|最后|还是|需要|一种|让|这个|时代|拥有|普通|认同|的|文化|价值|来|救赎| "},
	{"有人认为这是男人的“福音”，损害了弱者的利益 ","有人|认为|这是|男人|的|“|福音|”，|损害|了|弱者|的|利益| "},
	{"在金华市住房保障处办事大厅也公示了一份购买经适房公积金贷款的须知 ","在|金华市|住房|保障|处|办事|大厅|也|公示|了|一份|购买|经适|经适房|公积金|贷款|的|须知| "},
	{"专家表示，库存压力增大，下半年的降价压力已经显现 ","专家|表示|，|库存|压力|增大|，|下半年|的|降价|压力|已经|显现| "},
	{"集结旗下南都物业、南都管家、南有嘉会三个子品牌 ","集结|旗下|南|南都|物业|、|南|南都|管家|、|南有|嘉会|三|个子|品牌| "},
	{"各席别票价在现行票价水平基础上，下浮5%左右 ","各席别|票价|在|现行|票价|水平|基础上|，|下浮|5|%|左右| "},
	{"项余遇说，家属对这次安排非常满意 ","项余遇说|，|家属|对|这次|安排|非常|满意| "},
	{"与传统印象中吃“青春饭”的年轻服务生相比，尽管这些四五十岁的服务员的手脚不算麻利，却得到不少消费者的认可 ","与|传统|印象中|吃|“|青春|饭|”的|年轻|服务生|相比|，|尽管|这些|四|五|十岁|的|服务员|的|手脚|不算|麻利|，却|得到|不少|消费者|的|认可| "},
	{"“川味观”负责人章红红也表明了相同的观点，他对“大龄服务员”的工作表现同样非常认可 ","“|川味观|”|负责人|章|红红|也|表明|了|相同|的|观点|，|他对|“|大龄|服务员|”的|工作|表现|同样|非常|认可| "},
	{"有个女的刚从银行取钱出来，就被人打倒在地，刚取出的20万元，也被歹徒抢走了 ","有个|女的|刚从|银行|取钱|出来|，|就被|人|打倒|在地|，|刚取|出的|20|万元|，|也被|歹徒|抢走了| "},
	{"这时他的2名工友在旁边看到了，先后爬下去想要救他，但同样因为没有采取防护措施而中了毒 ","这时|他的|2|名|工友|在旁边|看到了|，|先后|爬下去|想要|救|他|，但|同样|因为|没有|采取|防护|措施|而|中了|毒| "},
	{"富阳消防大队赶到时，现场充斥着一股刺鼻的气味 ","富阳|消防大队|赶到|时|，|现场|充斥|着|一股|刺鼻|的|气味| "},
	{"真币毛主席头像的左眉毛与眼睛很清晰地分开，假币左眉毛与眼睛相连接 ","真币|毛主席|头像|的|左|眉毛|与|眼睛|很|清晰|地|分开|，|假币|左|眉毛|与|眼睛|相连|接| "},
	{"杨女士称，学校自2002年开办后，她曾多次向各级教委申办办学许可证，但一直未获批 ","杨|女士|称|，|学校|自|2002|年|开办|后|，|她|她曾|多次|向|各级|教委|申办|办学|许可证|，但|一直|未获|批| "},
	{"菅直人内阁的命运已“危在旦夕”，但仍不允许阁僚前往靖国神社 ","菅直人|内阁|的|命运|已|“|危在旦夕|”，但|”，|，但|仍不|允许|阁僚|前往|靖国神社| "},
	{"此前，民航局高层接受新华社采访时强调，在日常航班正常工作中，延误超过2小时的航班，空管部门必须优先安排飞机起飞 ", "此前|，|民航局|高层|接受|新华社|采访|时|强调|，在|日常|航班|正常工作|中|，|延误|超过|2|小时|的|航班|，|空管|部门|必须|优先|安排|飞机|起飞| "},
	{"出现大面积航班延误时，由空管部门尽快提出恢复计划以及二次放行计划 ","出现|大面积|航班|延误|时|，|由|由空管|空管|部门|尽快|提出|恢复|计划|以及|二次|放行|计划| "},
	{"我认为，当事人孙震已经承受了巨大的痛苦，他本人不应该被批评和嘲笑 ","我认为|，|当事人|孙震|已经|承受|了|巨大的|痛苦|，|他|本人|不应该|被|批评|和|嘲笑| "},
	{"我们不赞成和反感的不是个体做出的选择，而是某些宣传机构对这样的选择所持的态度 ","我们|不赞成|和|反感|的|不是|个体|做出|的|选择|，|而是|某些|宣传机构|对|这样的|选择|所持|的|态度| "},
	{"我一听到这件事情马上想起前段时间，重庆那位母亲去世不去送葬，而坚持赴京唱红歌的易如国老人 ","我一|听到|这件事|情|马上|想起|前段时间|，|重庆|那位|母亲|去世|不去|送葬|，而|坚持|赴京|唱红歌的|易如|国|老人| "},
	{"此事马上惊动了周恩来总理。他打电话问戚本禹是谁抢走的 ","此事|马上|惊动|了|周恩来|总理|。|他|打电话|问|问戚本禹|戚本|戚本禹|本禹|是谁|抢走|的| "},
	{"写花儿的一篇散文。花儿草儿，本是女性最喜摆弄的东西，假那形色，感怀寄情，喻人比己，也算见得多了 ","写|花儿|的|一篇|散文|。|花儿|草儿|，|本是|女性|最喜|摆弄|的|东西|，|假|假那|形色|，|感怀|寄情|，|喻人比己|，|也算|见得多了| "},
	{"白天倒澹如，一到晚上，烈得像酒精勾兑的假酒，一拧瓶口就哄地冒出股刺鼻的味来 ", "白天|倒澹如|，|一到|晚上|，|烈得|烈得像|得像|酒精|勾兑|的|假酒|，|一拧|瓶口|就哄地|冒出|股|刺鼻|的味来| "},
	{"联想到前些时一个网站组织计划生育问题讨论中辩论对手的激动情绪，使我感觉到，反对计划生育的声浪中存在着一种非理性的力量 ","联想到|前些|时|一个|网站|组织|计划生育|问题|讨论|中|辩论|对手|的|激动|情绪|，|使我|感觉到|，|反对|计划生育|的|声浪|中|存在着|一种|非理性|的|力量| "},
	{"此次英伦之行，英国人对帽子情有独锺，给我留下了难忘的印象 ","此次|英伦|之行|，|英国人|对|帽子|情有|独锺|，|给我|留下了|难忘|的|印象| "},
	{"晚年生活在美国的著名作家梁实秋先生，就是“比较文化”的专家 ","晚年生活|在|美国|的|著名作家|梁实秋|先生|，|就是|“|比较|文化|”的|专家| "},
	{"一位老人去世了，人们帮着一起去守夜 ","一位|老人|去世|了|，|人们|帮着|一起去|守夜| "},
	{"一开始还是挺正常的，到了凌晨一点的时候，突然大家看到老人的尸体一下子坐了起来，而且眼睛睁开了，当时就有人喊了一句诈尸了 ","一开始|还是|挺|正常的|，|到了|凌晨|一点|的|时候|，|突然|大家|看到|老人|的|尸体|一下子|坐了|起来|，|而且|眼睛|睁开|了|，|当时|就有|人|喊了|一句|诈尸|了| "},
	{"话音刚落，这个老爷子的尸体竟然自己躺了下去，而且也闭上了眼睛 ","话音刚落|，|这个|老爷子|的|尸体|竟然|自己|躺了|下去|，|而且|也|闭上|了|眼睛| "},
	{"因为，公婆给儿子买的房产什么的，离婚后媳妇是无份的 ","因为|，|公婆|给|儿子|买的|房产|什么的|，|离婚|后|媳妇|是无份的| "}
};

string readfromFile(const char *filename)
{
	char file[30] = "testfile\\";
	
  	strcat( file, filename);
	ifstream infile(file); 
	if(!infile){
			cerr<< "unable to open file";
			return false;
	}
		
	string str;		
	string input;
	while(infile>>str){
		input += str;
	}
	infile.close();

	return input;
}

string getStringFromVector(vector<string> &output)
{
	vector<string>::iterator iter;
	string strOutput;
	iter = output.begin();
	strOutput += *iter;
	iter++;
	while(iter != output.end())
	{
		strOutput += "|";
		strOutput += *iter;
		iter++;

	}

	return strOutput;
}


static bool test_segmentation()
{
	clock_t start = clock();
	PrepareDictionaries * pre = new PrepareDictionaries(); 
	
	pre->loadHashDictionares();
	  
	vector<string> output;
	string input,strOutput;
	int i = 0 ;
	for (const test *p = test_segmentation_strings; i < num; ++p, i++) {
		input = p->query;
		pre->searchHash(input);
	
		pre->getResult(output);
		
		strOutput =  getStringFromVector(output);
		
		TEST_STRINGS_EQUAL(strOutput, p->expect);
		
	}

	return true;

}


static const test_desc tests[] = {
	{"segmentation", test_segmentation}
};



int main(int argc, char* argv[])
{
	try {
		test_driver::parse_command_line(argc, argv);
		 return test_driver::run(tests);
	
	} catch (const char * e) {
		cout << e << endl;
		return 1;
	}
	
}